intro: in this exercise you will use mls_salaries_nans.csv as the data frame.

1. look at your data and get to know it a little. use info(), head(), tail, describe()- or whatever it is you want to map for yourself what needs to be done.

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('mls_salaries_nans.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 615 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              612 non-null    float64
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(2), object(4)
memory usage: 29.0+ KB

In [5]:
df.head(15)

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00
2,ATL,Asad,Yamil,M,150000.0,150000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00
5,ATL,Carmona,Carlos,M,675000.0,725000.00
6,ATL,Garza,Greg,D,150000.0,150000.00
7,ATL,Gonzalez Pirez,Leandro,D,250008.0,285008.00
8,ATL,Goslin,Chris,M,70000.0,74000.00
9,ATL,Gressel,Julian,NaN,75000.0,93750.00
10,ATL,Heath,Harrison,M,66150.0,66150.00
11,ATL,Jones,Kenwyne,F,390000.0,413333.33
12,ATL,Kann,Alec,GK,77004.0,77004.00
13,ATL,Kratz,Kevin,M,150000.0,164250.00
14,ATL,Larentowicz,Jeff,M,175008.0,175008.00

In [6]:
df.tail()

    club last_name first_name position  base_salary  guaranteed_compensation
610  VAN   Teibert    Russell        M     126500.0                 194000.0
611  VAN  Tornaghi      Paolo       GK      80000.0                  80000.0
612  VAN    Waston    Kendall        D     350000.0                 368125.0
613  NaN       NaN        NaN      NaN          NaN                      NaN
614  VAN  Williams    Sheanon        D     175000.0                 184000.0

In [7]:
df.describe()

        base_salary  guaranteed_compensation
count  6.120000e+02             6.140000e+02
mean   2.972454e+05             3.263752e+05
std    6.736826e+05             7.491217e+05
min    5.299992e+04             5.299992e+04
25%    6.563130e+04             7.003035e+04
50%    1.250000e+05             1.350020e+05
75%    2.512560e+05             2.798750e+05
max    6.660000e+06             7.167500e+06

2. The 'club' column contains NaN values. Delete rows with null values in this column and make the changes permanent

In [11]:
df.dropna(subset=['club'], inplace=True)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 614 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              612 non-null    float64
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(2), object(4)
memory usage: 33.6+ KB

3. The 'base_salary' and 'position' columns contain NaN values. Delete rows with null values in them and make the changes permanent

In [14]:
df.dropna(subset=['base_salary', 'position'], inplace=True)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 602 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     602 non-null    object
 1   last_name                602 non-null    object
 2   first_name               598 non-null    object
 3   position                 602 non-null    object
 4   base_salary              602 non-null    float64
 5   guaranteed_compensation  602 non-null    float64
dtypes: float64(2), object(4)
memory usage: 32.9+ KB

4.restore the data from the original file to continue this exercise.

In [16]:
df = pd.read_csv('mls_salaries_nans.csv')

5. there is 1 row that has NaN values in all columns. delete it, make the changes permanent.

In [17]:
df.dropna(how="all", inplace=True)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 614 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              612 non-null    float64
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(2), object(4)
memory usage: 33.6+ KB

6.The 'base_salary' column contains NaN values. Replace them with something that makes sense to you. make sure to make the change permanent

In [22]:
df['base_salary'].describe() # We choose to use the median as a filler for NaN values

count    6.120000e+02
mean     2.972454e+05
std      6.736826e+05
min      5.299992e+04
25%      6.563130e+04
50%      1.250000e+05
75%      2.512560e+05
max      6.660000e+06
Name: base_salary, dtype: float64

In [23]:
df['base_salary'].fillna(df['base_salary'].median(), inplace=True)

C:\Users\Daniel\AppData\Local\Temp\ipykernel_13272\2364823537.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['base_salary'].fillna(df['base_salary'].median(), inplace=True)

7. The 'club' column contains NaN values. Replace them with something that makes sense to you. make sure to make the change permanent

In [24]:
df['club'].mode()

0    VAN
Name: club, dtype: object

In [25]:
df['club'].fillna(df['club'].mode(), inplace=True)

C:\Users\Daniel\AppData\Local\Temp\ipykernel_13272\573944943.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['club'].fillna(df['club'].mode(), inplace=True)

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 614 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              614 non-null    float64
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(2), object(4)
memory usage: 33.6+ KB